import {
  Card,
  CardBody,
  Col, ListGroup, ListGroupItem,
} from "reactstrap";

const Rules = () => {
  return (
    <>
      <Col lg="12" md="12">
        <Card className="bg-secondary shadow border-0">
          <CardBody className="px-lg-5 py-lg-5">
            <div className="text-center text-muted mb-4">
              <big>Вітаємо тебе на сайті ГО “ЗЕОН”</big>
            </div>
            <p className="h4">Цей сайт створений для проведення квестів вулицями міста.
              Пропонуємо тобі ознайомитись з основними умовами участі у квесті, та погодитись з ними і дотримуватись їх.</p>
            <ListGroup>
              <ListGroupItem>Я беззаперечно підпорядковуватимуся всім вказівкам, і вимогам організаторів, що стосуються гри, під час участі у квесті.</ListGroupItem>
              <ListGroupItem>Я зобов’язуюся виконувати правила дорожнього руху, і сам несу відповідальність за своє здоров’я та життя, під час участі у квесті.</ListGroupItem>
              <ListGroupItem>Я зобов'язуюсь не вживати спиртні напої, наркотичні речовини та інші речовини, здатні викликати алкогольне, наркотичне та інші види сп'яніння, під час участі у квесті.</ListGroupItem>
              <ListGroupItem>Я фізично та морально підготовлений до участі у грі та до можливої   напруги під час участі у квесті.</ListGroupItem>
              <ListGroupItem>Я обізнаний, що виконання будь-якого завдання можливе без порушення законів та ризику для життя свого та оточуючих.</ListGroupItem>
              <ListGroupItem>Я зобов'язуюсь дотримуватися всіх чинних правил і законів. У разі недотримання правил і законів нестиму особисту відповідальність за їх порушення. Я буду невідступно дотримуватися всіх правил.</ListGroupItem>
              <ListGroupItem>Я даю згоду на обробку персональних даних та розміщення фото та відео з моєю участю, під час участі у квесті.</ListGroupItem>
            </ListGroup>
          </CardBody>
        </Card>
      </Col>
    </>
  );
};

export default Rules;
